Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.DWFXExportOptions,System.Collections.Generic.IList`1{System.String}@)
Exports the current view or a selection of views in DWFX format.
folder: Output folder, into which file(s) will be exported. The folder must exist.
name: Either the name of a single file or a prefix for a set of files.
If null or empty, automatic naming will be used.
views: Selection of views to be exported.
options: Various options applicable to the DWFX format.
If null, all options will be set to their respective default values.
uniqueIds: Output elements' unique ids container, all these elements which can be seen in views would be exported.
Returns: Function returns true only if all specified views are exported successfully.
The function returns False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input views is an empty ViewSet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not modifiable.
Remarks: All the views must be printable in order for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.